---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotEnoughNodes
source: html/4155e6c4-64c7-ecfc-d6db-176188b18e42.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotEnoughNodes Property

The calculation could not be executed as configured. Specify at least 4 elements before analyzing this network.

## Syntax (C#)
```csharp
public static FailureDefinitionId Network_NotEnoughNodes { get; }
```